In [14]:
pip install pandas

Collecting pandas
  Using cached pandas-2.2.0-cp310-cp310-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy<2,>=1.22.4 in c:\python310\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\python310\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\python310\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\python310\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Using cached pandas-2.2.0-cp310-cp310-win_amd64.whl (11.6 MB)
Installing collected packages: pandas
Successfully installed pandas-2.2.0
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.3.2 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [16]:
import pandas as pd

1.    צרו DataFrame של תלמידות עם העמודות: שם, כיתה, וממוצע ציונים.

In [19]:
data = {'שם': ['אליז', 'בת שבע', 'גליה'],
        'כיתה':['יג5', 'יד3', 'יב2'],
        'ממוצע ציונים': [98,76,89]}

In [20]:
sample = pd.DataFrame(data)
sample

       שם כיתה  ממוצע ציונים
0    אליז  יג5            98
1  בת שבע  יד3            76
2    גליה  יב2            89

2.    הוסיפו ל-DataFrame תלמידה חדשה.

In [26]:
sample.loc[len(sample.index)]= ['shosy', '6', 93]

In [27]:
sample

       שם כיתה  ממוצע ציונים
0    אליז  יג5            98
1  בת שבע  יד3            76
2    גליה  יב2            89
3   shosy    6            93

3.   הציגו רק את שמות התלמידות מה-DataFrame.

In [30]:
sample['שם']

0      אליז
1    בת שבע
2      גליה
3     shosy
Name: שם, dtype: object

בחרו והדפיסו את כל התלמידות שבכיתה 'יג5'

In [33]:
sample[sample['כיתה']=='יג5']

     שם כיתה  ממוצע ציונים
0  אליז  יג5            98

מצאו והדפיסו את התלמידה עם הממוצע הגבוה ביותר

In [35]:
sample['ממוצע ציונים'].max()

98

טענו את הנתונים מהקובץ cities.csv ל-DataFrame ב-pandas.

In [39]:
df = pd.read_csv(r'Z:/B/פרסון מלכה/פייתון מתקדם/lesson5/cities.csv')

In [40]:
df

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""","""State"""
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46,11,"""W""","""Wisconsin Dells""",WI
...,...,...,...,...,...,...,...,...,...,...
123,39,31,12,"""N""",119,48,35,"""W""","""Reno""",NV
124,50,25,11,"""N""",104,39,0,"""W""","""Regina""",SA
125,40,10,48,"""N""",122,14,23,"""W""","""Red Bluff""",CA
126,40,19,48,"""N""",75,55,48,"""W""","""Reading""",PA
127,41,9,35,"""N""",81,14,23,"""W""","""Ravenna""",OH

שלב 2: ניקוי נתונים

בדקו אם יש עמודות עם ערכים חסרים ומלאו אותם באפס או בערך הממוצע של העמודה, בהתאם להקשר.
הסירו שורות כפולות, אם ישנן.

In [50]:
df.isnull().sum()

LatD        0
 "LatM"     0
 "LatS"     0
 "NS"       0
 "LonD"     0
 "LonM"     0
 "LonS"     0
 "EW"       0
 "City"     0
 "State"    0
dtype: int64

In [47]:
df.LatD = df.LatD.fillna("abc")

In [53]:
df.drop_duplicates()

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""","""State"""
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46,11,"""W""","""Wisconsin Dells""",WI
...,...,...,...,...,...,...,...,...,...,...
123,39,31,12,"""N""",119,48,35,"""W""","""Reno""",NV
124,50,25,11,"""N""",104,39,0,"""W""","""Regina""",SA
125,40,10,48,"""N""",122,14,23,"""W""","""Red Bluff""",CA
126,40,19,48,"""N""",75,55,48,"""W""","""Reading""",PA
127,41,9,35,"""N""",81,14,23,"""W""","""Ravenna""",OH

שלב 3: ניתוח וחישובים

חשבו את הממוצע של אוכלוסייה לפי מדינה.
מצאו את העיר עם האוכלוסייה הגדולה ביותר והקטנה ביותר.

In [68]:
df.LatD.mean()

AttributeError: 'DataFrame' object has no attribute 'LatD'

שלב 4: שינויים והוספות

הוסיפו עמודה חדשה שתכיל את היחס בין אוכלוסייה לשטח העיר (אוכלוסייה לקמ"ר).
שנו את שם עמודת האוכלוסייה ל-"Population"

In [71]:
def get_population(s):
  return s."LatM"/s."LatS"


df['Population'] = df.model.apply(get_population)

SyntaxError: invalid syntax (3127640123.py, line 2)

שלב 5: סינון ומיון

סננו את הנתונים כך שישארו רק ערים מתוך מדינה אחת לבחירתכם.
מיינו את הנתונים לפי האוכלוסייה בסדר יורד.

In [74]:
df[df['LatD']=40]

SyntaxError: cannot assign to subscript here. Maybe you meant '==' instead of '='? (1907214546.py, line 1)

In [ ]:
df.sort_values